app/Controllers/Ppg.php

    public function index(): string
    {
        $model = new ProgramaPosGraduacaoModel();

        return view('ppg/index', [
            'title'    => 'Programas de Pós-Graduação',
            'programas'=> $model->orderBy('nome', 'ASC')->findAll(),
        ]);
---
SELECT *
FROM `programas_pos_graduacao`
ORDER BY `nome` ASC

    public function show(int $id): string
    {
        $programa = (new ProgramaPosGraduacaoModel())->find($id);

        if ($programa === null) {
            throw PageNotFoundException::forPageNotFound('Programa de pós-graduação não encontrado.');
        }

        $listas = [];

        foreach (['graus', 'cursos', 'areas_concentracao', 'linhas_pesquisa', 'instituicoes_associadas', 'atos_normativos'] as $campo) {
            $valor = json_decode((string) ($programa[$campo] ?? '[]'), true);
            $listas[$campo] = is_array($valor) ? $valor : [];
        }

        $db = db_connect();

        $linhas = $db->table('linhas_pesquisa')
            ->where('programa_id', $id)
            ->orderBy('nome', 'ASC')
            ->get()
            ->getResultArray();

        $vinculos = $db->table('docentes_linhas_pesquisa dlp')
            ->select("dlp.linha_pesquisa_id, i.id, i.nome, i.genero, i.email, i.lattes_id, i.orcid, dlp.tipo_vinculo, GROUP_CONCAT(DISTINCT inst.nome ORDER BY inst.nome SEPARATOR ', ') AS instituicoes", false)
            ->join('individuo i', 'i.id = dlp.docente_id')
            ->join('linhas_pesquisa lp', 'lp.id = dlp.linha_pesquisa_id')
            ->join('individuo_instituicao ii', 'ii.individuo_id = i.id', 'left')
            ->join('instituicao inst', 'inst.id = ii.instituicao_id', 'left')
            ->where('lp.programa_id', $id)
            ->orderBy('i.nome', 'ASC')
            ->groupBy('dlp.linha_pesquisa_id, i.id, dlp.tipo_vinculo')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `programas_pos_graduacao`
WHERE `programas_pos_graduacao`.`id` = 1
SELECT *
FROM `linhas_pesquisa`
WHERE `programa_id` = 1
ORDER BY `nome` ASC
SELECT `dlp`.`linha_pesquisa_id`, `d`.`nome`, `d`.`email`, `d`.`lattes_url`, `dlp`.`tipo_vinculo`
FROM `docentes_linhas_pesquisa` `dlp`
JOIN `docentes` `d` ON `d`.`id` = `dlp`.`docente_id`
JOIN `linhas_pesquisa` `lp` ON `lp`.`id` = `dlp`.`linha_pesquisa_id`
WHERE `lp`.`programa_id` = 1
ORDER BY `d`.`nome` ASC